%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%
%W  example.tex           POLENTA documentation            Bjoern Assmann
%W                                                     
%W                                                     
%W                                                       
%%
%H  @(#)$Id$
%%
%Y 2003
%%
\Chapter{An example application}

In this section we outline two example computations with the functions
of the previous chapter. 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Presentation for rational matrix groups}

\beginexample
gap> mats := 
[ [ [ 2, -1, -1, 3 ], [ -1, 0, 1, -4 ], [ 0, 1, 2, -2 ], [ -1, 1, 2, -4 ] ],
  [ [ 1, 1, 1, -2 ], [ 1, 1, -1, 1 ], [ -2, 1, 0, -3 ], [ -1, 1, 0, -2 ] ],
  [ [ 1, 0, -1, 0 ], [ -2, 5, 5, -11 ], [ -1, 0, 2, 0 ], [ -1, 1, 2, -2 ] ],
  [ [ 0, 3, 2, -7 ], [ -1, 6, 4, -13 ], [ -1, 2, 1, -5 ], [ -1, 3, 2, -7 ] ],
  [ [ 0, 4, 5, -12 ], [ 2, -4, 1, 5 ], [ 1, -4, -1, 8 ], [ 1, -3, 0, 5 ] ],
  [ [ 1, 0, -1, 0 ], [ -2, 5, 5, -11 ], [ -1, 0, 2, 0 ], [ -1, 1, 2, -2 ] ] ];

gap> G := Group( mats );
<matrix group with 6 generators>

# calculate an isomorphism from G to a pcp-group
gap> nat := IsomorphismPcpGroup( G );;   
     
gap> H := Image( nat );
Pcp-group with orders [ 2, 2, 3, 3, 4, 0, 0, 0 ]

gap> h := GeneratorsOfGroup( H );
[ g1, g2, g3, g4, g5, g6, g7, g8 ]

gap> mats2 := List( h, x -> PreImage( nat, x ) );;

# take a random element of G
gap> exp :=  [ 1, 1, 1, 1, 0, 0, 0, 0 ];;
gap> g := MappedVector( exp, mats2 );
[ [ 229793843, -345584045, -503782245, 823202280 ],
  [ 397912065, -598518263, -872506665, 1425593295 ],
  [ 141954212, -213549855, -311309508, 508615375 ],
  [ 189806315, -285510521, -416211500, 680033928 ] ]

# map g into the image of nat
gap> i := ImageElm( nat, g );
g1*g2*g3*g4

# exponent vector 
gap> Exponents( i );
[ 1, 1, 1, 1, 0, 0, 0, 0 ]

# compare the preimage with g
gap> PreImagesRepresentative( nat, i );
[ [ 229793843, -345584045, -503782245, 823202280 ],
  [ 397912065, -598518263, -872506665, 1425593295 ],
  [ 141954212, -213549855, -311309508, 508615375 ],
  [ 189806315, -285510521, -416211500, 680033928 ] ]
gap> last = g;
true

\endexample

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Modules series}

\beginexample
gap> gens := 
[ [ [ 1746/1405, 524/7025, 418/1405, -77/2810 ], 
    [ 815/843, 899/843, -1675/843, 415/281 ],
    [ -3358/4215, -3512/21075, 4631/4215, -629/1405 ],
    [ 258/1405, 792/7025, 1404/1405, 832/1405 ] ],
  [ [ -2389/2810, 3664/21075, 8942/4215, -35851/16860 ],
    [ 395/281, 2498/2529, -5105/5058, 3260/2529 ],
    [ 3539/2810, -13832/63225, -12001/12645, 87053/50580 ],
    [ 5359/1405, -3128/21075, -13984/4215, 40561/8430 ] ] ];

gap> H := Group( gens );
<matrix group with 2 generators>
     
gap> RadicalSeriesSolvableMatGroup( H );
[ [ [ 1, 0, 0, 0 ], [ 0, 1, 0, 0 ], [ 0, 0, 1, 0 ], [ 0, 0, 0, 1 ] ],
  [ [ 1, 0, 0, 79/138 ], [ 0, 1, 0, -275/828 ], [ 0, 0, 1, -197/414 ] ],
  [ [ 1, 0, -3, 2 ], [ 0, 1, 55/4, -55/8 ] ], 
  [ [ 1, 4/15, 2/3, 1/6 ] ], 
  [  ] ]
\endexample
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Triangularizable subgroups}

\beginexample
gap> G := PolExamples(3);
<matrix group with 2 generators>

gap> GeneratorsOfGroup( G );
[ [ [ 73/10, -35/2, 42/5, 63/2 ], 
    [ 27/20, -11/4, 9/5, 27/4 ],
    [ -3/5, 1, -4/5, -9 ], 
    [ -11/20, 7/4, -2/5, 1/4 ] ],
  [ [ -42/5, 423/10, 27/5, 479/10 ], 
    [ -23/10, 227/20, 13/10, 231/20 ],
    [ 14/5, -63/5, -4/5, -79/5 ], 
    [ -1/10, 9/20, 1/10, 37/20 ] ] ]

gap> T := TriangNormalSubgroupFiniteInd( G );
<matrix group with 5 generators>

gap> GeneratorsOfGroup( T );
[ [ [ 1, 21/5, 63/10, 189/5 ], 
    [ 0, 19/10, 27/20, 81/10 ],
    [ 9, -147/5, 32/5, 27/5 ], 
    [ -3, 93/10, -51/20, -53/10 ] ],
  [ [ -1223/10, 2061/5, -789/10, -708/5 ], 
    [ -597/20, 1009/10, -381/20, -171/5 ],
    [ 198/5, -657/5, 134/5, 231/5 ], 
    [ -39/20, 63/10, -27/20, -7/5 ] ],
  [ [ -23, 108, 141/10, 624/5 ], 
    [ -6, 28, 69/20, 153/5 ],
    [ 6, -27, -16/5, -183/5 ], 
    [ 0, 0, 3/20, 11/5 ] ],
  [ [ 251/5, -405/2, -39/5, -1437/10 ], 
    [ 57/5, -185/4, -21/10, -693/20 ],
    [ -102/5, 81, 8/5, 237/5 ], 
    [ 9/5, -27/4, 3/10, -31/20 ] ],
  [ [ 26/5, -63/5, 21/5, 63/5 ], 
    [ 9/10, -17/10, 9/10, 27/10 ],
    [ -12/5, 36/5, -7/5, -36/5 ], 
    [ 3/10, -9/10, 3/10, 19/10 ] ] ]

\endexample























